{
    "job0": {
        "location": "Shanghai, Shanghai, CHN",
        "work_term_support": "Stone,Merrirose",
        "number_of_openings": "2",
        "summary": "Title: Enterprise Business Control and Anti-Money Laundering<br /><br />BEFORE YOU APPLY FOR THIS JOB, ensure you read the additional considerations after the job description <br /> <br />IMPORTANT NOTE ABOUT EMPLOYMENT AUTHORIZATIONS: It is the student&#039;s responsibility to ensure that they have the necessary documentation required by the country the job is in to participate in this co-op work term. The University cannot provide related advice or arrange for this documentation on a student&#039;s behalf. The student must work with the employer and/or the issuing authority of the destination country to obtain this documentation. If the student cannot obtain the necessary documentation to participate in the co-op work term, the student must find an alternate co-op opportunity. <br /> <br />Working in a country without the necessary documentation can have serious consequences, including, but without limitation, being fined or detained. Any consequences that ensue from having inappropriate documentation are the student&#039;s responsibility. <br /><br />---------------------------------------------------------------------------------------<br /><br />The intern will assist BMO Asia to complete projects and perform tasks related to risk and control. The intern will be exposed to risk management and control processes over financial services, the financial services regulatory environment, and will learn about financial services product offerings. <br /><br />Job Responsibilities <br /><br />Assigned tasks will include some of the following: <br /><br />- Analysis of regulatory and policy requirements <br />- Review of initiatives, policies, procedures, etc. <br />- Creation and execution of business controls<br />- Completion of Anti-Money Laundering files<br />- Business process mapping and business continuity/process recovery work <br />- Administrative tasks (document management, updating contact lists, preparing English summaries of Chinese documents, translation) <br />- Sharepoint administration and updating <br />- Data collection, review, reconciliation and report preparation from other departments <br />- System analysis and programming - mainly in Excel (pivot tables, summaries) and/or Access <br /><br />Requirements: <br /><br />- strong analysis and critical thinking skills<br />- good communication skill and problem solving skill<br />-&nbsp; Should be comfortable working in English (strong) and Mandarin (native level) <br />- Software development skills desirable in&nbsp; Excel (pivot tables, summaries) and/or Access<br />- Mainland Chinese Citizenship (for visa reasons - non-negotiable)<br /><br />Other disciplines welcome <br /><br />NOTES: For immigration purposes, this role REQUIRES MAINLAND CHINESE CITIZENSHIP.<br /><br />*IMPORTANT NOTE FROM CECA RE: EMPLOYMENT OUTSIDE Canada and USA * <br />This work opportunity will be outside Canada and USA, and therefore will have certain financial realities.&nbsp; Students should be aware that student salaries in countries outside North America are typically significantly lower than Canadian minimum wages, and that it is unlikely that the local salary will allow for any significant level of savings during the work term. Also, international companies do not necessarily provide any additional compensation for airfare, work permit or housing expenses. Sign-offs will not be permitted for financial reasons; so, please review what is covered or not covered in the compensation details. Use a currency converter like http://www.bankofcanada.ca/rates/exchange/daily-converter/&nbsp; to understand the Canadian equivalent.&nbsp; Students should assume that all expenses related to airfare, work permit and housing will be the responsibility of the student. <br />It is also for the student to determine whether they are eligible to work in the specific country in question. To assess your eligibility, please go to https://uwaterloo.ca/co-operative-education/working-abroad/finding-international-job-opportunities/are-you-eligible-work-abroad, and read the information listed in its entirety before you apply for this job. <br />Before you apply to this job, please be aware of mandatory and other requirements for students working outside Canada: https://uwaterloo.ca/co-operative-education/working-abroad/found-international-job-jobmine. <br />Co-op students who are successful in obtaining an international co-op work term can consider applying for international travel awards /scholarships detailed at Student Awards and Financial Aid (SAFA): https://uwaterloo.ca/student-awards-financial-aid/international-experience-awards. Apply as early as possible as applications have deadlines - see SAFA site for details.",
        "job_title": "Enterprise Business Controls & Anti-Money Launder",
        "unit_name": "Bank of Montreal (China) Co Ltd",
        "discipline": "MATH- (unspecified), All Business (unspecified), MATH-Computing & Financial Mgm",
        "employer_name": "Bank of Montreal",
        "level": "Junior, Intermediate",
        "hiring_support": "Tymchuk,Gail",
        "comments": "This role REQUIRES MAINLAND CHINESE CITIZENSHIP. Pay rates are based on LOCAL MAINLAND MARKET RATES (extremely low by North American standards).",
        "job_identifier": "00299299"
    },
    "job13": {
        "location": "Mississauga",
        "work_term_support": "Hayes,Donna",
        "number_of_openings": "2",
        "summary": "Summary:<br /><br />Are you tired of coop placements where you sit at your desk with nothing to do? Would you like to get your hands dirty doing real sql development and web development using some of the newer web technologies and practices like responsive design and mobile development? Are you interested in working with data? Are you looking for a work placement that could grow into something more than just a couple of work terms to satisfy your co-op program criteria? <br /><br />If you answered &quot;yes&quot; to most of these questions then you are the kind of co-op student we are looking for at kenna (www.kenna.ca). We are looking for bright and personable students to help our development staff on a number of different projects. <br /><br />This job might specify Math and Engineering students but if you are enrolled in a different faculty and have strong web/design skills and an interest in application development and specifically SQL then feel free to apply! <br /><br />Responsibilities:<br /><br />- SQL Query Requests <br />- SQL Scripts for Web Applications (stored procedures, table value functions, etc.)<br />- Web development (both mobile and desktop) <br />- Working with a team to support and maintain existing applications <br />- Investigating new technologies <br /><br />Required Skills:<br /><br />- SQL <br />- DHTML <br />- CSS <br />- Javascript <br />- Solid communication skills (both written and oral) <br /><br />The following would be an asset: <br />- jQuery <br />- AJAX <br />- HTML5 and CSS3 <br />- LotusScript or Visual Basic <br />- Responsive design experience <br /><br />Career Development And Training:<br /><br />A number of development personnel at kenna have been hired straight from school after completing coop terms with us. We provide hands-on training during your term to get you up to speed and catering your co-op experience based on your needs and capabilities.<br /><br /><br /><br /><br />&quot;I learned so many new things and everyone was always willing to help me if I ever had any questions. There was always new projects on the go and I was never sitting around without work. Working at Kenna was amazing!&quot;<br /><br />Helen Schroeder<br />Computer Science (Studio Fine Arts Minor)<br />3B Co-op Term<br />4 Month Co-op",
        "job_title": "SQL Application Developer",
        "unit_name": "Mississauga Location",
        "discipline": "MATH-Computer Science, MATH-Combinatorics & Optimizat, MATH-Computing & Financial Mgm",
        "employer_name": "Kenna",
        "level": "Junior, Intermediate, Senior",
        "hiring_support": "Martin,Elaine",
        "comments": " ",
        "job_identifier": "00295339"
    },
    "job7": {
        "location": "Toronto",
        "work_term_support": "Facca,Stephanie",
        "number_of_openings": "1",
        "summary": "As a Senior Software Engineer, you will play a central role in the design and development of the services and entitlements platform. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume domain services/api management platform with Java using an Agile development methodology. <br /><br />As a fast-growing startup, we look for self-starters who thrive in a fast-paced, agile environment&nbsp; which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises.&nbsp; <br /><br />In this role you work with a small, collaborative team of engineers, product managers, and designers&nbsp; so excellent interpersonal and communication skills are also a must.&nbsp; And most importantly&nbsp; we look for people that can prioritize, multi-task, and deliver&nbsp; because it&#039;s a lot more fun to get things done<br /><br />Must Haves Skills:<br />- Work with product owners and team lead to interpret feature requests and develop software in iterative design/build/test cycles using an Agile development process<br />- Build software components with multi-threading concepts using threads and synchronization<br />- Strong Experience in creating SOAP/WSDL/XML/REST web services, along with CORS filter management<br />- Regularly check code into our continuous integration pipeline based on Gradle, Git and Jenkins to incrementally build our overall system and get immediate feedback on build performance<br />- Develop and expand unit and integration tests which will be automatically run by the build pipeline for developer feedback using JUnit and other tools like Geb, Spock and Selenium<br />- Assists in resolving production support problems. Develops and suggests alternative approaches to resolving problems.<br /><br />Tools and Frameworks:<br />- Expert on Spring Core, Spring MVC, Spring Web Services, Spring web flow<br />- Expert with Eclipse, Maven, GIT and CI servers (e.g. Jenkins/Hudson, GO, Bamboo)<br />- Expert knowledge with oAuth mechanism implementation<br />- Expert knowledge with JBOSS EAS or IBM Websphere application server<br />- Utilize redisson, galaxy, hazelcast for in memory data grids.<br />- Experience working with social service APIs (Twitter, Facebook, Instagram, etc.) is preferred",
        "job_title": "Java Developer",
        "unit_name": " ",
        "discipline": "ENG-Computer, ENG-Software, ENG-Systems Design",
        "employer_name": "CSI Consulting",
        "level": "Intermediate, Senior",
        "hiring_support": "Schunk,Diane",
        "comments": " ",
        "job_identifier": "00292088"
    },
    "job16": {
        "location": "Toronto",
        "work_term_support": "Carter,Corinne",
        "number_of_openings": "1",
        "summary": "Position Summary: <br /><br />We are looking for an intermediate/senior student who is welcome to work more than one work term. Previous experience in business environment is preferred. Recommendations from previous work places are welcome.<br /><br />Position Responsibilities: <br /><br />- Help Desk support to company users in timely manner<br />- Day to day System/Network administration and support<br />- Work in a team and individually<br />- Participate in design and implementation of System/Network upgrade and modification<br />- Contribute new ideas and innovations for technological improvements<br />- Maintain and extend System/Network documentation<br />- System Programming and Scripting<br /><br />Skills: <br /><br />- Strong communication skills, both oral and written<br />- Ability to learn both technical and professional skills <br />-&nbsp; Project Management experience<br />- Knowledge of the following operating systems: MS Windows XP, 7, 8.1, and Server 2003/2008/2012<br />- Knowledge of the following applications: MS Word, Excel, Outlook 2003/2010, Visio <br />- Knowledge of the following network protocols: TCP/IP, VPN, MAPI, DNC, DHCP, ActiveDirectory<br />- Knowledge of the following hardware platforms and standards: Intel x86, SCSI, SATA, RAID, SAS, VNC, RDP, VmWare ESXi, GoToMeeting (WebEx), TeamViewer<br />- It would be an advantage to know the following: MS Access AutoCAD, ASP.NET, C++, ACT, SysPro<br /><br />Company Description: <br /><br />Commit 100 is a computer system and network engineering company based in Mississauga, Ontario. Company specializing in providing medium size clients with computer engineering solutions as well as day-to-day on-site technical support. We offer a unique co-op program that allows students to be involved in maintenance and administration of large-scale corporate systems and networks. The &quot;alter-ego&quot; program pairs students in different work/study streams to allow seamless transitions between terms.<br /><br />Co-op students at Commit 100 are involved in many aspects of the business including selection of new co-op students. A student will have chance to review resumes, ask questions, and provide input into the hiring of prospective students.<br /><br />For more information visit http://commit100.com",
        "job_title": "Systems and Network Specialist",
        "unit_name": "Commit100",
        "discipline": "ENG-Computer, ENG-Electrical, ENG-Software",
        "employer_name": "Kirnichansky & Associates Inc",
        "level": "Junior, Intermediate",
        "hiring_support": "Redfearn,Barb",
        "comments": " ",
        "job_identifier": "00295309"
    },
    "job20": {
        "location": "Mississauga",
        "work_term_support": "Carter,Corinne",
        "number_of_openings": "1",
        "summary": "Innovation that excites.&nbsp; It&#039;s the inspiration for everything we do. For Nissan, it means rethinking the ordinary, pushing the boundaries, exceeding expectations and anticipating the needs of an ever-changing planet. Every Nissan and Infiniti vehicle is a result of this passionate mindset, yet with a practical side that reflects the times. This means driving enjoyment rooted in the highest standard of engineering and quality, and fresh, modern design matched by manufacturing excellence. The same philosophy also drives our look to the future, through low emissions, better fuel economy and emerging role of all-electric vehicles. All dedicated to innovative solutions, for different - and better - ways to do things.<br />Co-op students will be provided the opportunity to apply classroom studies while networking with Nissan professionals and gaining valuable experience. <br /><br />The Dealer Network Development department&#039;s responsibilities include Network Strategy, Dealer performance, Dealer Documentation and the Nissan and Infiniti facility image programs.<br /><br />Summary Project Description:<br /><br />-Support for Nissan Performance Improvement Program. Includes measuring of key KPIs, monitoring and tracking of Dealer Performance<br />-Support for D360 initiatives. D360 is our web based platform which is our Dealer dashboard for key KPIs, Programs, Field Contact reports, documentation, etc.<br />-Support Facilities image programs for both Nissan and Infiniti. Support with report tracking, project completions, and ad hoc requests.<br /><br />Education Requirements:<br /><br />Eligible candidates must be currently enrolled in an accredited under-graduate Business or Marketing University Program.",
        "job_title": "Dealer Network Development - Facilities",
        "unit_name": " ",
        "discipline": "ARTS-Arts & Business, All Business (unspecified), MATH-Business Administration",
        "employer_name": "Nissan Canada Inc",
        "level": "Intermediate",
        "hiring_support": "Hartley,Julie",
        "comments": " ",
        "job_identifier": "00300388"
    },
    "job4": {
        "location": "Toronto",
        "work_term_support": "Facca,Stephanie",
        "number_of_openings": "1",
        "summary": "As a Senior Software Engineer, you will play a central role in the design and development of next generation UI for multiple products and custom builds. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume domain services/api management platform with UI development tech using an Agile development methodology. <br /><br />As a fast-growing startup, we look for self-starters who thrive in a fast-paced, agile environment&nbsp; which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises.&nbsp; <br /><br />In this role you work with a small, collaborative team of engineers, product managers, and designers so excellent interpersonal and communication skills are also a must.&nbsp; And most importantly we look for people that can prioritize, multi-task, and deliver&nbsp; because it&#039;s a lot more fun to get things done<br /><br />REQUIREMENTS<br />- Over 5 years of UI web application development experience<br />- 5 years demonstrated experience with client side frameworks such as AngularJS, Backbone, Knockout or Ember<br />- 2 years visualization tools in javascript (D3, WebGL)<br />- 2 years Visualizing data in Tableau, Qlik or similar business intelligence tools<br />- 2 years Prior experience building Javascript interactive applications that display very large data sets responsively<br />- At least 3+ years of User interface programming experience including HTML5, CSS, JavaScript, AJAX, and cross-browser<br />- Expert knowledge of JavaScript (with understanding of latest standards such as ECMA5 and 6), HTML4/5, CSS3, jQuery<br />- Expert knowledge of CSS pre-processors and post-processors can do for you and you can make a fair judgement at choosing them. (eg: SASS/LESS/PostCSS etc). <br />- Love automating things; can write Custom Grunt/Gulp Scripts to automate everything front-end.<br />- Strong verbal and written communication skills<br />- Bachelor&#039;s Degree in Computer Science, Computer Engineering and/or relevant work experience<br /><br />Bonus Points<br />- A strong distaste for SPOF and heartfelt love of automation. <br />- Startup experience, entrepreneurial spirit, energetic!<br />- Web development experience",
        "job_title": "UI Developer",
        "unit_name": " ",
        "discipline": "ENG-Computer, ENG-Software, ENG-Systems Design",
        "employer_name": "CSI Consulting",
        "level": "Intermediate, Senior",
        "hiring_support": "Schunk,Diane",
        "comments": " ",
        "job_identifier": "00292090"
    },
    "job10": {
        "location": "Toronto",
        "work_term_support": "Wall,Chantal",
        "number_of_openings": "1",
        "summary": "Organization Overview<br /><br />Environment and Climate Change Canada is a department within the Federal Public Service.&nbsp; With a budget in excess of $600 million dollars and approximately 4,700 employees located in 100 communities across Canada, we work with thousands of partners in every province and territory and around the globe.&nbsp; <br /><br />Environment and Climate Change Canada&#039;s mandate is to preserve and enhance the quality of the natural environment, including water, air and soil quality; conserve Canada&#039;s renewable resources, including migratory birds and other non-domestic flora and fauna; conserve and protect Canada&#039;s water resources;&nbsp; forecast weather and environmental change; enforce the rules made by the Canada - United States International Joint Commission relating to boundary waters; and coordinate environmental policies and programs for the federal government. <br /><br />Our vision is to see a Canada where people make responsible decisions about the environment, and where the environment is thereby sustained for the benefit of present and future generations.<br /><br />Our mission is to make sustainable development a reality in Canada by helping Canadians live and prosper in an environment that needs to be respected, protected and conserved.<br /><br />At Environment and Climate Change Canada we value our environment and its vital importance to the identity and well-being of present and future generations; the dedication and team-work of our people and integrity, trust and mutual respect in our working relationships; the contribution of the natural and social sciences to environmentally responsible decision making; the exercise, by all Canadians, of a shared responsibility for our environment; the contribution of our leadership to the achievement of sustainable development; and the provision of quality service to the public.&nbsp; <br /><br />For more information about Environment Canada please visit our web site at http://www.ec.gc.ca.<br /><br />Background on the Organics Analysis Laboratory <br /><br />The Organics Analysis Laboratory (OAL) of Environment Canada monitors the deposition of toxic organic pollutants in the Great Lakes Basin Network (GLB) under Canada\\xc2\\xbfs Chemical Management Plan (CMP) Monitoring and Surveillance Project.&nbsp; As well, OAL is tasked with the monitoring of toxic organic pollutants in the Arctic as part of the Northern Contaminants Program (NCP) as well as special studies like the Oil Sands and the 2015 PAN AM Games in Toronto.&nbsp; OAL is a modern analytical laboratory equipped with state-of-the art instrumentation and provides a high-quality capability for the determination of trace organic species in support of GLB and NCP activities. The pollutants of concern include polychlorinated biphenyls, organochlorine pesticides, polybrominated diphenyl ethers, polycyclic aromatic hydrocarbons, polychlorinated naphthalenes, polychlorinated dibenzodioxins, perfluorinated compounds and synthetic musks.&nbsp; <br /><br /><br /><br />Job Title&nbsp; :<br />Chemical Technician<br /><br /><br />Job Duties <br /><br />Sample preparation by extracting atmospheric samples collected from the Great Lakes Basin and Arctic.&nbsp; This will involve the use of Soxhlets, Accelerated Solvent Extraction and/or Solid Phase Extraction.<br /><br />Analyzing samples for synthetic musks using gas chromatography - mass spectrometer (GC-MS); liquid chromatography \\xc2\\xbf mass spectrometer (LC-MS-MS);and/or liquid chromatography - fluorescence detector (HPLC-FLD).<br /><br />Integration of the Toronto 2015 PAN AM Games chromatographic data and entry into spreadsheets ready for reporting.<br /><br />Preparation of glassware by washing glassware in a glassware washer, rinsing the glassware with acetone and baking in a glassware oven.<br /><br /><br />Job Requirements<br /><br />\\xc2\\xbfThe applicant should have successfully completed at minimum, the first year of University in Chemistry, Environmental Chemistry, Environmental Science or similar.&nbsp; Specific courses required are analytical chemistry and organic chemistry and/or environmental/atmospheric chemistry. <br />\\xc2\\xbfLaboratory experience is required (e.g., working with solvents and knowledge of safe laboratory practices).<br />\\xc2\\xbfDetail-oriented.<br />\\xc2\\xbfAbility to work well in a team environment.<br />\\xc2\\xbfDependable and self motivated.<br />\\xc2\\xbfAbility to communicate effectively.<br />\\xc2\\xbfBe functionally versed in Microsoft Office software programs.<br />\\xc2\\xbfPrevious laboratory experience in analytical and wet chemistry and familiarity with gas chromatography or liquid chromatography are assets.<br />\\xc2\\xbfPreference will be given to Canadian citizens.&nbsp; Proof of citizenship must be provided at the time of the interview.&nbsp; Applicants will be subject to a security clearance check prior to being offered a letter of employment (form to be completed prior to the interview). This is an English essential position.&nbsp; Applicants should have a functional understanding and practical grasp of the English language and be able to communicate effectively in that language.<br /><br />Other Information<br />Hours of Work Per Week:&nbsp; 37.5<br />Normal Hours of work (time of day start and end): 8:00 am \\xc2\\xbf 4:00 pm<br />Expected Dates of Employment (start and end dates):&nbsp; September 6, 2016 \\xc2\\xbf December 30, 2016<br />Location: Toronto (Downsview)",
        "job_title": "Chemical Technician",
        "unit_name": "Meteorological Service of Canada",
        "discipline": "ENG-Chemical, SCI-Chemistry, SCI-Biochemistry",
        "employer_name": "Environment and Climate Change Canada",
        "level": "Intermediate",
        "hiring_support": "Koso,Sandor",
        "comments": " ",
        "job_identifier": "00300394"
    },
    "job6": {
        "location": "Toronto",
        "work_term_support": "Facca,Stephanie",
        "number_of_openings": "2",
        "summary": "As a Senior Software Engineer, you will play a central role in the design and development of our service layer platform. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume data platform with JS using an Agile development methodology. <br /><br />As a fast-growing startup, we look for self-starters who thrive in a fast-paced, agile environment&nbsp; which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises.&nbsp; <br /><br />In this role you work with a small, collaborative team of engineers, product managers, and designers so excellent interpersonal and communication skills are also a must.&nbsp; And most importantly we look for people that can prioritize, multi-task, and deliver because it&#039;s a lot more fun to get things done<br /><br />Requirements <br />- Excellent knowledge of JavaScript (knowledge of transpilers a plus)<br />- Excellent knowledge of developing REST API using Node.js; similar to frameworks like Restify, Express, Strongloop, Apiary. Etc.<br />- Knowledge of Relational and NoSQL databases Cassandra, MangoDB etc.<br />- Deep understanding of version control systems Git, including branching and merging strategies<br />- Adequate knowledge of programming languages deployed in Linux &amp; Windows env. including Node.js, Java, C++, C, etc.<br />- Solid working knowledge of integrating with Hadoop db to source data.<br />- Solid knowledge of AngularJS/ReactJS/Others.",
        "job_title": "Node JS Developer",
        "unit_name": " ",
        "discipline": "ENG-Computer, ENG-Software, MATH- (unspecified)",
        "employer_name": "CSI Consulting",
        "level": "Intermediate, Senior",
        "hiring_support": "Schunk,Diane",
        "comments": " ",
        "job_identifier": "00292089"
    },
    "job3": {
        "location": "Markham",
        "work_term_support": "Nakhoul,Sami",
        "number_of_openings": "2",
        "summary": "Technical Analyst <br /><br />A unique opportunity to be involved in large consulting engagements. <br /><br />Note:&nbsp; Limited to students in their 3rd year or higher. <br /><br />Work in conjunction with our senior and lead architects on large projects across multiple verticals in the GTA.&nbsp; Contribute to projects involving technical analysis, solution design, problem-solving and end-to-end integration.&nbsp; Work with a large array of technology platforms and applications.&nbsp; Work will be project-based and take place at CGI and on-site with our clients. <br /><br />The ideal candidate will bring a positive attitude, willingness to learn, good communications and team skills, and the ability to put their knowledge to work in a project-oriented technical activities. <br /><br />CGI Information Systems and Management Consultants Inc. (CGI) assist private and public sector organizations with professional services of outstanding quality, competence, performance and objectivity. We deliver best-of-breed solutions to fully satisfy client objectives in information technology. <br /><br />Candidates with prior work term experience in technical analysis roles are encouraged to apply. <br /><br />In particular, we require highly-motivated individuals with exposure to, or a strong desire to learn about: <br /><br />Technical Knowledge <br />* Java and Object-oriented Programming <br />* WSDL, XML and Schema design and development <br />* Spring framework <br />* Hibernate framework <br />* iBatis framework <br />* TIBCO Active Matrix <br />* TIBCO Business Studio <br />* Oracle RDBMS <br />* JAS-WS, and JAXB2 <br />* SVN, Hudson, and Maven <br />* Eclipse IDE <br /><br />Systems Analysis Skills <br />* Application Architecture <br />* Data Architecture <br />* Security and Network Communications <br />* MSOffice tools <br />* Web services governance <br />* Multi-tier architectures <br />* Systems analysis and preparation of specifications <br />* Quality assurance and software testing methods <br />* Project management <br /><br />Functions Performed <br />* Evaluate and understand the underlying business goals <br />* Support business development opportunities <br />* Research new technology opportunities and product offerings <br />* Analyze solutions to business problems <br />* Deal with different technologies and platforms <br />* Communicate clearly (verbal, text, and diagrams) <br /><br />We are offering the chance to work with our team of experienced professionals on a range of engagements. Our clients include large financial institutions, which will make this a rare opportunity to learn about consulting in the most advanced business environments.<br /><br />About CGI <br />Founded in 1976, CGI Group Inc. is the fifth largest independent information technology and business process services firm in the world. Approximately 68,000 professionals serve thousands of global clients from offices and delivery centers across the Americas, Europe and Asia Pacific, leveraging a comprehensive portfolio of services including high-end business and IT consulting, systems integration, application development and maintenance, infrastructure management as well as a wide range of proprietary solutions. With annual revenue in excess of C$10 billion and an order backlog of C$20 billion, CGI shares are listed on the TSX (GIB.A) and the NYSE (GIB).Website: www.cgi.com. <br /><br />This is a great opportunity to join a winning team! At CGI, we&#039;re in the business of satisfying clients. For more than 35 years, we&#039;ve operated upon the principles of sharing in clients&#039; challenges and delivering quality services to address them. CGI offers entry-level positions for new graduates, and being a co-op at CGI is a great way to introduce yourself to us.&nbsp; We wish to thank all applicants for their interest and effort in applying for this position; however, only candidates selected for interviews will be contacted.",
        "job_title": "BKS - Technical Analyst - Global Wealth",
        "unit_name": "Systems Integration & Consulting",
        "discipline": "MATH-Computer Science, ENG-Software, ENG-Computer",
        "employer_name": "CGI Group Inc",
        "level": "Intermediate, Senior",
        "hiring_support": "Phillips-Davis,Colleen",
        "comments": "4 and 8 Month work term available",
        "job_identifier": "00294271"
    },
    "job9": {
        "location": "Stratford",
        "work_term_support": "Adaran,Margaret",
        "number_of_openings": "1",
        "summary": "Engineering Assistant<br />Disciplines: ENG-Mechanical, ENG-Mechatronics, ENG-Electrical<br />Levels: Intermediate, Senior<br />Comments: Within easy commuting distance of Kitchener/Waterloo. Re-engaging in Coop to continue the long history of a successful Coop partnership.<br /><br />The Company: <br />Cooper Standard Automotive Canada is a TS16949 registered supplier of elastomeric sealing systems and body/engine mounts to the automotive industry. We design and manufacture components at 4 plants in Ontario as well as develop and formulate our own rubber compounds. At the Stratford plant we produce Body Sealing products. <br /><br />Job summary: <br />Update in-house electrical and mechanical drawings for the extrusion, molding and finishing production equipment. Work under the direction of the Maintenance, Controls and Project Management groups. Assist with updates and development of the Computerized Maintenance Management System (CMMS) and support ongoing improvements to the maintenance business processes. <br /><br />Job Requirements: <br />-Currently enrolled in either Mechanical, Mechatronics or Electrical Engineering program <br />-Technical knowledge of electrical and mechanical systems and related drawing terminology <br />-Strong computer skills including proficiency with AutoCAD and SolidWorks <br />-Knowledge of CMMS systems such as MP2 an asset <br />-Ability to work independently once an assignment has been communicated <br />-Organize workload to coordinate and execute an effective completion plan <br />-Communicate effectively with all levels within the manufacturing community <br /><br />Student Outcomes:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />The successful applicant can expect to get out of this co-op experience exposure to an entire manufacturing facility, rather than a single department experience. By supporting the Maintenance group, the student will work with the Skilled Trades group, production operators and other Engineering departments and designations. The wide variety of projects and assignments will help give the student a broader understanding of an automotive manufacturing facility.<br /><br />Disclaimer: <br />The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as required.",
        "job_title": "Engineering Assistant",
        "unit_name": " ",
        "discipline": "ENG-Mechanical, ENG-Mechatronics, ENG-Electrical",
        "employer_name": "Cooper Standard Automotive",
        "level": "Intermediate, Senior",
        "hiring_support": "Ross,Colin",
        "comments": " ",
        "job_identifier": "00300426"
    },
    "job2": {
        "location": "St-Laurent",
        "work_term_support": "Mercer,Zac",
        "number_of_openings": "1",
        "summary": "Want to work in a dynamic, innovation-focused, diverse and fast-paced environment? If so, we can&#039;t wait to meet you!<br /><br />What you should know about the Immersive Environment Group: <br /><br />-It looks like gaming, but it&#039;s not:<br />-We create flight simulation systems, using our own rendering engine. <br />-We develop a realistic, immersive training environment through visual and sensory cues in the simulator. <br />-We optimize and constantly develop new features according to the needs of our customers (civil aviation, defense, security and health).<br />-We are an international and dynamic team: composed of more than 200 members from Canada, India and Hungary.<br />-We\\xc2\\xbfre experts in real time computer graphics, 3D rendering, object-oriented programming (C++, C#...), algebra!<br /><br />120,000 civil and military crewmembers as well as thousands of health professionals are trained on our simulators annually!<br /><br />Who are we looking for?<br />-A team player who is eager to learn about our core features, how to tune various special effects and create scenarios.<br />-An innovative thinker looking for ways to improve our work processes and tools.<br />-A programmer able to integrate, test, debug and prototype new cutting-edge technologies!<br /><br />Your qualifications:<br />-You&#039;re currently doing your Bachelor&#039;s degree in Computer Science, Software Engineering or Computer Engineering.<br />-You have a good knowledge in C++.<br />-You have good communication and organizational skills.<br />-You&#039;re bilingual (French and English).<br />-C#, .NET framework knowledge and any experience in developing computer graphics are considered an asset!<br /><br />If selected, you will have the opportunity to join one of our multidisciplinary teams:<br /><br />-Visual Software: image generator (IG, aka 3D rendering engine and IG platform development)<br />-Visual Display: display optics design and projector solutions<br />-Computer Generated Forces: driving artificial intelligence and emergency or military training scenarios<br />-Visual tools and framework<br />-Terrain, weather and navigation servers<br />-Motion and sound: reproducing realistic vibrations, turbulences and sound effects<br /><br />Who is CAE?<br /><br />At CAE, we are a step ahead in simulation and training. Founded in 1947 in Canada, CAE is a global leader in providing comprehensive training solutions based on world-leading simulation technology and integrated training services. The company employs 8,000 people at more than 160 sites and training locations in 35 countries.<br /><br /><br />Note<br /><br />All applicants must be legally entitled to work in Canada and must meet the requirements of the Canadian Controlled Goods Program (CGP). Applicants who are hired will be required to complete, sign and return the Controlled Goods Program form within the week following the mailing date. They must also provide a copy of their passport or birth certificate. All students with a work permit must provide of a copy of it and the original of the certificate of good conduct of countries where they lived in during the last 5 years.<br /><br />For all interns hired, we will reimburse internship fees up to $250 per intern, upon presentation of supporting documents.<br /><br />We appreciate you taking the time to submit your application.&nbsp; However, we advise only those who qualify for an interview will be contacted.",
        "job_title": "Software Developer",
        "unit_name": " ",
        "discipline": "ENG-Computer, ENG-Electrical, ENG-Software",
        "employer_name": "CAE",
        "level": "Junior, Intermediate",
        "hiring_support": "Chamberlain,Jeff",
        "comments": " ",
        "job_identifier": "00298806"
    },
    "job19": {
        "location": "Mississauga",
        "work_term_support": "Carter,Corinne",
        "number_of_openings": "1",
        "summary": "Innovation that excites.&nbsp; It&#039;s the inspiration for everything we do. For Nissan, it means rethinking the ordinary, pushing the boundaries, exceeding expectations and anticipating the needs of an ever-changing planet. Every Nissan and Infiniti vehicle is a result of this passionate mindset, yet with a practical side that reflects the times. This means driving enjoyment rooted in the highest standard of engineering and quality, and fresh, modern design matched by manufacturing excellence. The same philosophy also drives our look to the future, through low emissions, better fuel economy and emerging role of all-electric vehicles. All dedicated to innovative solutions, for different - and better - ways to do things.<br />Co-op students will be provided the opportunity to apply classroom studies while networking with Nissan professionals and gaining valuable experience. <br /><br />The Dealer Network Development department&#039;s responsibilities include Network Strategy, Dealer performance, Dealer Documentation and the Nissan and Infiniti facility image programs.<br /><br />Summary Project Description:<br /><br />-Support for Nissan Performance Improvement Program. Includes measuring of key KPIs, monitoring and tracking of Dealer Performance<br />-Support for D360 initiatives. D360 is our web based platform which is our Dealer dashboard for key KPIs, Programs, Field Contact reports, documentation, etc.<br />-Support Facilities image programs for both Nissan and Infiniti. Support with report tracking, project completions, and ad hoc requests.<br />-Documentation Tracking including New Dealer appointments and Buy/Sell documentation<br />oPreparation of Balance of Documentation via checklist<br />-Support transition to an online documentation management system <br />-KPI reporting of all DND Strategy Network related reporting.<br />-Support the Geo-marketing team with data collection used to identify potential network opportunities.<br />-Maintain Polk credentials database and utilize Polk Registrations to report on Dealer Efficiency.<br /><br />Education Requirements:<br /><br />Eligible candidates must be currently enrolled in an accredited under-graduate Business or Marketing University Program.",
        "job_title": "Dealer Network Development",
        "unit_name": " ",
        "discipline": "ARTS-Arts & Business, All Business (unspecified), MATH-Business Administration",
        "employer_name": "Nissan Canada Inc",
        "level": "Intermediate",
        "hiring_support": "Hartley,Julie",
        "comments": " ",
        "job_identifier": "00300389"
    },
    "job1": {
        "location": "Markham",
        "work_term_support": "Nakhoul,Sami",
        "number_of_openings": "1",
        "summary": "COMPANY OVERVIEW<br /><br />At Brookfield Residential, our passion is creating &#039;the best places to call home&#039;. We work in a wide variety of markets in different locations, and make a point of catering to unique local buyers in each one. We are an innovative land developer and homebuilder with 60 years of experience, focused on creating places to live that are thoughtfully designed and cultivate exceptional life experiences, providing comfort, inclusiveness, and a sense of place.<br /><br />In addition, Brookfield Residential has won numerous awards from industry peers and consumer groups for green building and energy efficiency, design, marketing, and company achievement. Our team members are also recognized for the good work they do both at Brookfield and in the community. We do our best to add value to everything we do. That&#039;s what makes us different.<br /><br />Since 1956, Brookfield Residential has built the reputation of building quality homes and developing many communities across Ontario. Our efforts in delivering outstanding design have been recognized by industry associations, as we have received the highest ranking for customer satisfaction and have been recognized as the Builder of the Year in Ontario. We apply the highest standards in creating neighbourhoods and are dedicated to providing the best craftmanship that speaks to the aspirations of homebuyers from every walk of life. We strongly believe that our homes are synonymous with quality, value and integrity - and we are committed to keeping our promises.<br /><br />KEY JOB FUNCTIONS include but not limited to:<br />-Assisting with community engineering, planning, and design coordination<br />-Assisting with efficiency optimization of land development projects<br />-Project cost tracking<br />-Liaising with internal sales, marketing, architectural, home construction, and finance teams<br />-Acquiring final approvals for construction, land registration, and municipal assumption<br />-Project schedule development<br />-Market research<br />-Evaluation of provincial policy documents<br />-Development charge tracking<br /><br /><br />SKILLS/KNOWLEDGE/EDUCATION<br />-Computer literate with strong working knowledge of MS Office applications (Word, Excel, PowerPoint, Outlook) <br />-Experience with Adobe Illustrator would be an asset <br />-Excellent written and verbal communication skills <br />-Ability to work with accuracy and strong attention to detail <br />-Strong organizational skills, with the ability to keep track of multiple priorities and follow up as needed <br />-Has own vehicle",
        "job_title": "Co-Op Student",
        "unit_name": " ",
        "discipline": "ENG-Civil, ENV-Planning",
        "employer_name": "Brookfield Residential Properties Inc",
        "level": "Junior, Intermediate, Senior",
        "hiring_support": "Brockenshire,Sarah",
        "comments": "Own Vehicle Required.",
        "job_identifier": "00300391"
    },
    "job11": {
        "location": "Toronto",
        "work_term_support": "Wall,Chantal",
        "number_of_openings": "1",
        "summary": "HelloFresh is the leading global company in the growing online meal kit delivery market. Having expanded successfully in 8 other countries, we have recently launched in Canada. This is a unique opportunity to gain experience working at an international company in a fast-paced start-up environment. Your responsibility would be to support the procurement department in developing a sustainable sourcing strategy and evaluating new and existing suppliers based on their product range, quality and reliability. You can learn more about the company at www.hellofresh.ca<br /><br />Responsibilities<br />- Assist the Sr. Procurement Manager and Head of Operations with procurement decisions for various food and non-food categories.<br />- Perform cost analysis to identify suitable ingredient and vendor options on a weekly basis.<br />- Review purchase orders, coordinate and schedule timely deliveries with food and non-food suppliers.<br />- Forecast demand requirements, manage inventory and track consumption of incoming material.<br />- Develop and manage network of suppliers and vendors, including researching and negotiating with new suppliers and proposing new ideas to improve our ingredients and packaging.<br />- Collect data for supplier performance and resolve quality/performance problems.<br />- Identify cost saving opportunities and perform cost-benefit analysis for various ingredient categories.<br /><br />Required Skills<br />- Currently pursuing a Bachelor&#039;s degree, preferably in Engineering, Business or Mathematics.<br />- Quantitative and analytical experience - must be comfortable with MS Excel.<br />- General knowledge of and strong interest in different foods and ingredients.<br />- Must be proactive, ambitious, and assertive: you take ownership of your work and think beyond the scope of a given assignment.<br />- You should be entrepreneurial with a strong attitude towards getting things done.",
        "job_title": "Procurement Analyst",
        "unit_name": " ",
        "discipline": "ARTS-Arts & Business, ARTS-Financial Management, ENG-Management",
        "employer_name": "HelloFresh",
        "level": "Intermediate, Senior",
        "hiring_support": "D'Arcy,Cheryl",
        "comments": " ",
        "job_identifier": "00300404"
    },
    "job18": {
        "location": "Newmarket",
        "work_term_support": "Karsan,Alnoor",
        "number_of_openings": "1",
        "summary": "JOB OVERVIEW<br /><br />This person is accountable for assisting the warehouse team in the analysis and implementation of warehouse and material flow improvement opportunities. <br /> <br />KEY JOB RESPONSIBILITIES<br /><br />- Conduct time studies on warehouse employees<br />- Populate internal materials databases<br />- Analyze material flow from entry to exit <br />- Develop warehouse process flow diagrams and flowcharts<br />- Perform other duties as required or assigned by the Assistant Warehouse Manager <br /><br />HEALTH AND SAFETY RESPONSIBILITIES<br /><br />- Ensure all safety and non-safety plant rules and regulations are followed.<br />- Ensure adherence to established quality and housekeeping standards.<br />- Review and adhere to Dortec&#039;s health and safety, environmental, and quality standards, operating procedures, and policies. <br />- Respond immediately to items brought to his/her attention with respect to hazards, defects or non-compliance issues.<br />- Understand and uphold the principals of Bill 168 which prohibit domestic violence, workplace violence, and workplace harassment<br />- In addition to the above, the duties include those specified under the Occupational Health &amp; Safety Act, Sec. 28 - Duties of a Worker<br /><br />REQUIRED SKILLS:<br /><br />- Enrolment in a post-secondary program related to Mechanical Engineering or Materials Management <br />- Computer literate in AutoCAD, Microsoft Applications, Lotus Notes, and Visio<br />- Previous experience in a warehouse environment an asset <br /><br />CORE COMPETENCIES <br /><br />- Understanding of Lean Manufacturing principles<br />- Knowledge of the Kaizen process<br />- Self-motivated and well developed interpersonal skills<br />- Good time management and problem solving skills<br />- Strong attention to detail",
        "job_title": "Materials Process & Handling Co-op",
        "unit_name": "Dortec Industries",
        "discipline": "ENG-Mechanical, ENG-Management, ENG-Systems Design",
        "employer_name": "Magna Closures Inc",
        "level": "Intermediate",
        "hiring_support": "Redfearn,Barb",
        "comments": " ",
        "job_identifier": "00300413"
    },
    "job14": {
        "location": "Mississauga",
        "work_term_support": "Hayes,Donna",
        "number_of_openings": "2",
        "summary": "Summary <br /><br />Are you tired of coop placements where you sit at your desk with nothing to do? Would you like to get your hands dirty doing real web development using some of the newer web technologies and practices like responsive design and mobile development? Do you enjoy working with data? Do you get a sense of accomplishment when you see your work published for public consumption? Are you looking for a work placement that could grow into something more than just a couple of work terms to satisfy your co-op program criteria? <br /><br />If you answered &quot;yes&quot; to most of these questions then you are the kind of co-op student we are looking for at kenna. We are looking for bright and personable students to help our web development staff on a number of different projects. <br /><br />This job might specify Math and Engineering students but if you are enrolled in a different faculty and have strong web/design skills and an interest in web development feel free to apply! <br /><br />Responsibilities <br /><br />- Web development (from mobile phones to iPads to desktop solutions) <br />- Working with a team to support and maintain existing applications <br />- Creating and maintaining a weekly online newsletter <br />- Investigating and using new technologies and techniques <br />- Completing weekly timesheets <br /><br /><br />Required Skills <br />- DHTML <br />- CSS <br />- Javascript <br />- Solid communication skills (both written and oral) <br /><br />The following would be an asset: <br />- jQuery <br />- AJAX <br />- elements that are new to HTML5 Eg: offline app dev, canvas, etc... <br />- LotusScript or Visual Basic <br />- SQL <br />- Familiarity with Content Management Systems (CMS) <br />- Responsive design experience <br /><br /><br />Career Development And Training <br />A number of development personnel at kenna have been hired straight from school after completing coop terms with us. We provide hands-on training during your term to get you up to speed and catering your co-op experience based on your needs and capabilities.<br /><br /><br /><br />&quot;I learned so many new things and everyone was always willing to help me if I ever had any questions. There was always new projects on the go and I was never sitting around without work. Working at Kenna was amazing!&quot;<br /><br />Helen Schroeder<br />Computer Science (Studio Fine Arts Minor)<br />3B Co-op Term<br />4 Month Co-op",
        "job_title": "Web Application Developer",
        "unit_name": "Mississauga Location",
        "discipline": "MATH-Computer Science, ENG-Computer, ENG-Software",
        "employer_name": "Kenna",
        "level": "Intermediate, Senior",
        "hiring_support": "Martin,Elaine",
        "comments": " ",
        "job_identifier": "00295337"
    },
    "job15": {
        "location": "Toronto",
        "work_term_support": "Carter,Corinne",
        "number_of_openings": "1",
        "summary": "Position Summary: <br /><br />We are looking for an intermediate/senior student who is welcome to work more than one work term. Previous experience in business environment is preferred. Recommendations from previous work places are welcome.<br /><br />Position Responsibilities:<br /><br />- Programming and Scripting<br />- Requirements gathering<br />- Code Testing<br />- Documentation (design document, inline code commenting, user manual, etc.)<br />- Presentation to upper management<br />- User training<br />- Interaction with customer<br /><br />Skills:<br /><br />- Strong communication skills, both oral and written<br />- Ability to learn both technical and professional skills<br />- Knowledge of the one or many of the following languages: MS Access (VB code), ASP.NET, HTML/CSS/JavaScript<br />- It would be an advantage to know the following: ,ava/Grails, C#.NET, PHP<br />- Knowledge of the one or many of the following platforms (developer&#039;s toolkits): iPhone OS, Android, Blackberry 10 OS, Microsoft Mobile 6.5 OS<br />- Code Testing (unit, stress, and user acceptance)<br />- Presentation in PowerPoint<br /><br />Company Description: <br /><br />Kirnichansky &amp; Associates Inc (KnA) is a computer system and network engineering company based in Mississauga, Ontario. Company specializing in providing medium size clients with computer engineering solutions as well as day-to-day on-site technical support. KnA offers a unique co-op program that allows students to be involved in maintenance and administration of large-scale corporate systems and networks. The &quot;alter-ego&quot; program pairs students in different work/study streams to allow seamless transitions between terms.<br /><br />Co-op students at KnA are involved in many aspects of the business including selection of new co-op students. A student will have chance to review resumes, ask questions, and provide input into the hiring of prospective students<br /><br />For more information visit http://commit100.com",
        "job_title": "Application Developer",
        "unit_name": "Commit100",
        "discipline": "ENG-Computer, MATH-Computer Science, ENG-Software",
        "employer_name": "Kirnichansky & Associates Inc",
        "level": "Intermediate, Senior",
        "hiring_support": "Redfearn,Barb",
        "comments": " ",
        "job_identifier": "00295310"
    },
    "job17": {
        "location": "Mississauga",
        "work_term_support": "Braedley,Melissa",
        "number_of_openings": "1",
        "summary": "Summary<br /><br />This student will be reporting to Lab Management.<br /><br />The Co-Op student must be in-process of graduation to Master of Science or Bachelor degree in a related field of chemical engineering, metallurgical material testing and to posses strong communication, and organizational skills. <br /><br />The GTA Materials Lab provides a wide range of testing services in mechanical field and technical support in automotive and metallurgical fields to other Martinrea Divisions and outside customers (commercial testing) at industry competitive rates.<br /><br />Responsibilities:<br /><br />- Sample and fixture preparation - (mechanical and plumbing work) <br />- Conducting mechanical testing - (tensile, hardness etc.) <br />- Environmental durability testing set up: vibration, temperature cycling <br />- Physical, Metallurgical &amp; chemical testing (coating, metallurgical cross sectioning, micro etching, leak testing) <br />- Preparation of test report, statistical analysis of test data<br />- Writing of SOP.<br /><br />Required Skills<br /><br />- Capable of designing basic test fixtures using AUTOCAD and machining of fixture components (optional)<br />- Basic knowledge of electronic and signal processing for DAQ<br />- Computer advanced skill to develop Excel macros and knowledge of Adobe Acrobat advanced features<br />- Knowledge of automotive product testing and pneumatic/fluid dynamics systems will be asset <br />- Mechanically inclined; detail oriented <br />- Good communicator &amp; team worker with positive work ethic <br />- Work undependably without close supervision <br />- Capable of doing heavy lifting.<br /><br />Transportation And Housing<br /><br />Student must be staying within commutable distance and have own means of transportation to work.",
        "job_title": "Test Engineering",
        "unit_name": "Caledon Tubing",
        "discipline": "ENG-Chemical",
        "employer_name": "MARTINREA  International Inc",
        "level": "Junior, Intermediate, Senior",
        "hiring_support": "Ross,Colin",
        "comments": " ",
        "job_identifier": "00299839"
    },
    "job8": {
        "location": "Breslau",
        "work_term_support": "Middleton,Keith",
        "number_of_openings": "1",
        "summary": "Works as part of the Engineering team on several aspects of capital project work including creating or updating project documentation and AutoCAD (2D or 3D) drawings. Project work includes design of production lines and facilities, perform data analysis, deliver reports, carry out plant or construction site inspections, coordinate the work of contractors, generate drawings or sketches, and design specifications to meet drawing requirements for the project in accordance with CMP standards.<br /><br />Responsibilities:<br />1.&nbsp; Work independently on design and drawing assignments.<br />2.&nbsp; Work with the CMP management team on the design of new plant or line layout proposals. <br />3.&nbsp; Update/modify plant drawings such as equipment blocks, process flow diagrams, fire safety plans, egress paths, process piping, mechanical services layouts, electrical services layouts and miscellaneous sketches using AutoCAD.<br />4.&nbsp; Gather and organize data such as plant square footage or other dimensions, and equipment utility requirements, as requested. <br />5.&nbsp; Organize and maintain the CMP AutoCAD drawing library, and provide AutoCAD support to all functional groups. <br />6.&nbsp; Perform various administrative and technical duties as assigned such as document management, revision control and action item lists.<br />7.&nbsp; Understand and follow project standards, protocols and health &amp; safety policies.<br />8.&nbsp; Check drawings for compliance with industries\\xc2\\xbf and organization\\xc2\\xbfs specific codes and standards.<br />9.&nbsp; Work with the engineering team in order to generate deliverables (e.g., drawings, reports, etc.) in a timely fashion to meet project schedule requirements.<br />10. Identify engineering errors and omissions including interferences, collisions, deviations from specifications, or discrepancies. <br />11. Submit a monthly report to your manager.<br /><br />Please note: Some travel to our distribution centre in Cambridge, ON, is required.<br /><br />Required Skills:<br />* Eligible to work in Canada<br />* Driver&#039;s licence, with your own reliable personal vehicle (mileage compensation for work related travel) <br />* Experience and working knowledge with AutoCAD is an asset <br />* Senior Engineering Student in an appropriate undergraduate program (Chemical, Mechanical or Biological Engineering)<br />* Experience in a manufacturing environment<br />* Ability to understand, interpret and generate plant/engineering drawings<br />* Ability to work independently, take initiatives and ownership of given tasks <br />* Excellent interpersonal skills and ability to relate with equipment suppliers, tradesmen, site foremen, site superintendents, manufacturing plant maintenance and production personnel, CMP management.<br /><br />Please note: Some travel to our distribution centre in Cambridge, ON, is required.<br /><br />Mandatory Requirements:<br />* Valid Unrestricted Driver&#039;s Licence <br />* Has Own Transportation<br /><br />Compensation And Benefits Information:&nbsp; $20.00 per hour",
        "job_title": "Engineering Assistant",
        "unit_name": " ",
        "discipline": "ENG-Chemical, ENG-Mechanical, ENG-Mechatronics",
        "employer_name": "Conestoga Meat Packers Ltd",
        "level": "Intermediate, Senior",
        "hiring_support": "Witmer,Ruth",
        "comments": "NOTE:  8-month consecutive work term REQUIRED. Before applying please discuss your work/study sequence flexibility with your academic advisor.  Driver's Licence and Transportation required.",
        "job_identifier": "00293686"
    },
    "job5": {
        "location": "Toronto",
        "work_term_support": "Facca,Stephanie",
        "number_of_openings": "1",
        "summary": "As a Senior Software Engineer, you will play a central role in the design and development of the predictive analytics platform. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume data platform with Java using an Agile development methodology. <br /><br />As a fast-growing startup, we look for self-starters who thrive in a fast-paced, agile environment which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises.&nbsp; <br /><br />In this role you work with a small, collaborative team of engineers, product managers, and designers so excellent interpersonal and communication skills are also a must.&nbsp; And most importantly we look for people that can prioritize, multi-task, and deliver&nbsp; because it&#039;s a lot more fun to get things done<br /><br />Requirements <br />- Solid understanding of Map/Reduce, Pig, Hive, Hama and Hadoop eco-system.<br />- Expertise in Real Time Analytics and Systems such as Spark, Storm, Mahout. <br />- Strong experience building complex data pipelines.<br />- 2+ years of hands-on experience with developing Java-based MR applications on large scale Big Data environments, capacity planning, performance tuning and monitoring.<br />- Experience with High Performance Computing, In-Memory DB, Caching Optimization, Compression Techniques, Cluster Management, etc.<br />- Solid in at-least one compiled and interpreted language. Prefer Java and Python.<br />- Knowledge in key-value stores like HBase/Cassandra, Redis, Riak.<br />- Passionate about software: active on GitHub.<br />- Experience gathering business requirements and translating them into technical solutions.<br />- Ability to juggle multiple projects without losing focus.<br />- Strong communication skills(verbal and written).<br /><br />Bonus Points<br />- A strong distaste for SPOF and heartfelt love of automation. <br />- Startup experience, entrepreneurial spirit, energetic!<br />- Web development experience",
        "job_title": "Senior Software Engineering",
        "unit_name": " ",
        "discipline": "ENG-Computer, ENG-Software, ENG-Electrical",
        "employer_name": "CSI Consulting",
        "level": "Intermediate, Senior",
        "hiring_support": "Schunk,Diane",
        "comments": " ",
        "job_identifier": "00292087"
    },
    "job12": {
        "location": "Toronto",
        "work_term_support": "Wall,Chantal",
        "number_of_openings": "1",
        "summary": "HelloFresh is the leading global company in the growing online meal kit delivery market. Having expanded successfully in 8 other countries, we have recently launched in Canada. This is a unique opportunity to gain experience working at an international company in a fast-paced start-up environment. Being part of the operations team, you would help identify risks and inefficiencies in the supply chain and develop proposals to improve weekly production and logistics performance. You can learn more about the company at www.hellofresh.ca<br /><br />Responsibilities<br />- Assist the Sr. Supply Chain Manager and Head of Operations with supply chain and operational activities.<br />- Analyze the entire vendor-to-customer supply chain, identify cost-saving opportunities and develop a plan for execution.<br />- Research new logistics suppliers and propose ideas related to improve delivery performance.<br />- Collect error reports and weekly data for operations and supply chain, and make related process improvement recommendations.<br />- Develop a tool to identify material requirements and coordinate with production facility to manage inventory and track consumption of packaging material.<br />- Schedule timely deliveries and moving of material from off-site storage facilities to the production facility.<br /><br />Required Skills<br />- Currently pursuing a Bachelor&#039;s degree, preferably in Engineering, Business or Mathematics.<br />- Strong interest in operations and supply chain.<br />- Quantitative and analytical experience - must have experience using MS Excel.<br />- Must be proactive, ambitious, and assertive: you take ownership of your work and should think beyond the scope of a given assignment<br />- You should be entrepreneurial with a strong attitude towards getting things done.<br />- Ideally, some previous exposure to a manufacturing or warehousing environment.",
        "job_title": "Supply Chain Analyst",
        "unit_name": " ",
        "discipline": "ARTS-Financial Management, ENG-Management, ENG-Mechanical",
        "employer_name": "HelloFresh",
        "level": "Intermediate, Senior",
        "hiring_support": "D'Arcy,Cheryl",
        "comments": " ",
        "job_identifier": "00300400"
    }
}